{
  "format": "layers-model",
  "generatedBy": "keras v2.11.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "keras_version": "2.11.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "Model_2",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 400, 12],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "conv1d_3_input"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_3",
              "trainable": true,
              "dtype": "float32",
              "batch_input_shape": [null, 400, 12],
              "filters": 64,
              "kernel_size": [2],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_5",
              "trainable": true,
              "dtype": "float32",
              "axis": [2],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_3",
              "trainable": true,
              "dtype": "float32",
              "strides": [2],
              "pool_size": [2],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [2],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_6",
              "trainable": true,
              "dtype": "float32",
              "axis": [2],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_4",
              "trainable": true,
              "dtype": "float32",
              "strides": [2],
              "pool_size": [2],
              "padding": "valid",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 200,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_7",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 100,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_8",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": "float32",
              "units": 50,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_9",
              "trainable": true,
              "dtype": "float32",
              "axis": [1],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_6",
              "trainable": true,
              "dtype": "float32",
              "units": 6,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          },
          {
            "class_name": "Precision",
            "config": {
              "name": "precision_1",
              "dtype": "float32",
              "thresholds": null,
              "top_k": null,
              "class_id": null
            }
          },
          {
            "class_name": "Recall",
            "config": {
              "name": "recall_1",
              "dtype": "float32",
              "thresholds": null,
              "top_k": null,
              "class_id": null
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": false,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_5/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_5/moving_variance",
          "shape": [64],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["group2-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_6/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_6/moving_variance",
          "shape": [32],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["group3-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_7/gamma",
          "shape": [200],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/beta",
          "shape": [200],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/moving_mean",
          "shape": [200],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_7/moving_variance",
          "shape": [200],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["group4-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_8/gamma",
          "shape": [100],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/beta",
          "shape": [100],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/moving_mean",
          "shape": [100],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_8/moving_variance",
          "shape": [100],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["group5-shard1of1.bin"],
      "weights": [
        {
          "name": "batch_normalization_9/gamma",
          "shape": [50],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_9/beta",
          "shape": [50],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_9/moving_mean",
          "shape": [50],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_9/moving_variance",
          "shape": [50],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["group6-shard1of1.bin"],
      "weights": [
        { "name": "conv1d_3/kernel", "shape": [2, 12, 64], "dtype": "float32" },
        { "name": "conv1d_3/bias", "shape": [64], "dtype": "float32" }
      ]
    },
    {
      "paths": ["group7-shard1of1.bin"],
      "weights": [
        { "name": "conv1d_4/kernel", "shape": [2, 64, 32], "dtype": "float32" },
        { "name": "conv1d_4/bias", "shape": [32], "dtype": "float32" }
      ]
    },
    {
      "paths": ["group8-shard1of1.bin"],
      "weights": [
        { "name": "dense_3/kernel", "shape": [3200, 200], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [200], "dtype": "float32" }
      ]
    },
    {
      "paths": ["group9-shard1of1.bin"],
      "weights": [
        { "name": "dense_4/kernel", "shape": [200, 100], "dtype": "float32" },
        { "name": "dense_4/bias", "shape": [100], "dtype": "float32" }
      ]
    },
    {
      "paths": ["group10-shard1of1.bin"],
      "weights": [
        { "name": "dense_5/kernel", "shape": [100, 50], "dtype": "float32" },
        { "name": "dense_5/bias", "shape": [50], "dtype": "float32" }
      ]
    },
    {
      "paths": ["group11-shard1of1.bin"],
      "weights": [
        { "name": "dense_6/kernel", "shape": [50, 6], "dtype": "float32" },
        { "name": "dense_6/bias", "shape": [6], "dtype": "float32" }
      ]
    }
  ]
}
